#Contents List
##Import Libraries
##3.Import Data - orders_products_combined.pkl
##4. Check the shape
##Import Data - products_checked.csv
##Drop Unnamed columns and _merge column in df_orders_products_combined dataframe
##Drop Unnamed column in df_prods dataframe
##5. Determine a suitable way to combine the orders_products_combined dataframe with your products data set.
##6. Confirm the results of the merge using the merge flag.
##7. Export the newly created dataframe as orders_products_merged in a suitable format (taking into consideration the size). - orders_products_merged.pkl

In [1]:
#Import Libraries
import pandas as pd
import numpy as np
import os

In [20]:
#3. Import orders_products_combined.pkl
df_orders_products_combined = pd.read_pickle(r'C:\Users\Family Computer\Documents\Data Analytics\Instacart Basket Analysis\02 Data\Prepared Data\orders_products_combined.pkl')

In [21]:
#4. Check the shape
df_orders_products_combined.shape

(32434489, 12)

In [22]:
df_orders_products_combined.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,hour_of_day_ordered,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,0,0,2539329,1,1,2,8,NaN,196,1,0,both
1,0,0,2539329,1,1,2,8,NaN,14084,2,0,both
2,0,0,2539329,1,1,2,8,NaN,12427,3,0,both
3,0,0,2539329,1,1,2,8,NaN,26088,4,0,both
4,0,0,2539329,1,1,2,8,NaN,26405,5,0,both

In [23]:
path = r'C:\Users\Family Computer\Documents\Data Analytics\Instacart Basket Analysis'

In [24]:
#Import products_checked.csv
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col=False)

In [25]:
df_prods.shape

(49672, 6)

In [26]:
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [27]:
#Drop Unnamed columns and _merge column in df_orders_products_combined dataframe
df_orders_products_combined = df_orders_products_combined.drop(columns = ['Unnamed: 0.1', 'Unnamed: 0', '_merge'])

In [28]:
df_orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,hour_of_day_ordered,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

In [29]:
df_orders_products_combined.shape

(32434489, 9)

In [30]:
#Drop Unnamed column in df_prods dataframe
df_prods = df_prods.drop(columns = ['Unnamed: 0'])

In [31]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [32]:
df_prods.shape

(49672, 5)

In [37]:
#5. Determine a suitable way to combine the orders_products_combined dataframe with your products data set.
df_orders_products_merged = df_orders_products_combined.merge(df_prods, on = 'product_id', indicator = True)

In [38]:
df_orders_products_merged.head()

,order_id,user_id,order_number,orders_day_of_week,hour_of_day_ordered,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

In [39]:
#6. Confirm the results of the merge using the merge flag.
df_orders_products_merged['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [43]:
#7. Export the newly created dataframe as orders_products_merged in a suitable format (taking into consideration the size).
df_orders_products_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged.pkl'))